Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, 50, 50)            1350      
_________________________________________________________________
gru_1 (GRU)                  (None, 150)               90900     
_________________________________________________________________
dense (Dense)                (None, 27)                4077      
=================================================================
Total params: 96,327
Trainable params: 96,327
Non-trainable params: 0
_________________________________________________________________