Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_8 (Embedding)      (None, 50, 50)            1350      
_________________________________________________________________
gru_8 (GRU)                  (None, 100)               45600     
_________________________________________________________________
dense_8 (Dense)              (None, 27)                2727      
=================================================================
Total params: 49,677
Trainable params: 49,677
Non-trainable params: 0
_________________________________________________________________