Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_7 (Embedding)      (None, 50, 50)            1350      
_________________________________________________________________
gru_7 (GRU)                  (None, 150)               90900     
_________________________________________________________________
dense_7 (Dense)              (None, 27)                4077      
=================================================================
Total params: 96,327
Trainable params: 96,327
Non-trainable params: 0
_________________________________________________________________