Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_6 (Embedding)      (None, 50, 50)            1350      
_________________________________________________________________
gru_6 (GRU)                  (None, 150)               90900     
_________________________________________________________________
dense_6 (Dense)              (None, 27)                4077      
=================================================================
Total params: 96,327
Trainable params: 96,327
Non-trainable params: 0
_________________________________________________________________